# FamilyCreate Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..FamilyCreate Property
Document Class See Also
---
An object that can be used to create new instances of Autodesk Revit API elements within a family document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyItemFactory FamilyCreate { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilyCreate As FamilyItemFactory
	Get
```

Visual C++
---
```text
public:
property FamilyItemFactory^ FamilyCreate {
	FamilyItemFactory^ get ();
}
```

# ### Field Value
This object is used to create new instances of family elements within the Autodesk Revit API, such as Extrusion or Reference lines.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the current document is project document. |

# See Also
Document Class
Autodesk.Revit.DB Namespace